import 'package:quiz_app/models/quiz_questions.dart';
const questions = [
QuizQuestion(
'پاکستان کا دارالحکومت کیا ہے؟',
[
'اسلام آباد',
'لاہور',
'کراچی',
'پشاور',
],
),
QuizQuestion(
'پاکستان کا قومی پرندہ کون سا ہے؟',
[
'چکور',
'باز',
'شاہین',
'مرغبان',
],
),
QuizQuestion(
'پاکستان کی سب سے بڑی ریاست کون سی ہے؟',
[
'بلوچستان',
'سندھ',
'پنجاب',
'خیبر پختونخوا',
],
),
QuizQuestion(
'پاکستان کا سب سے بڑا شہر کون سا ہے؟',
[
'کراچی',
'لاہور',
'اسلام آباد',
'فیصل آباد',
],
),
QuizQuestion(
'پاکستان کا قدیم ترین شہر کون سا ہے؟',
[
'موہن جو دڑو',
'ٹیکسلا',
'ہرپا',
'قدیم ملتان',
],
),
QuizQuestion(
'پاکستان کی سب سے اہم خارجی سرمایہ کاری کی مصدر کون سا ہے؟',
[
'چین',
'امریکا',
'عرب امارات',
'برطانوی راج',
],
),
];